app/Models/Sale.php

INSERT INTO `ospos_sales_payments` (`sale_id`, `payment_type`, `payment_amount`, `cash_refund`, `cash_adjustment`, `employee_id`) VALUES (79, 'mpesa', '150', 0, 0, 2)
---
            ];

            $builder = $this->db->table('sales_payments');
            $builder->insert($sales_payments_data);

INSERT INTO `ospos_sales_items` (`sale_id`, `item_id`, `line`, `description`, `serialnumber`, `quantity_purchased`, `discount`, `discount_type`, `item_cost_price`, `item_unit_price`, `item_location`, `print_option`) VALUES (79, '1', 1, '', '', '1', '0', 0, '250.00', '150.00', 1, 0)
---
            ];

            $builder = $this->db->table('sales_items');
            $builder->insert($sales_items_data);

INSERT INTO `ospos_sales_taxes` (`sale_id`, `tax_type`, `tax_group`, `sale_tax_basis`, `sale_tax_amount`, `print_sequence`, `name`, `tax_rate`, `sales_tax_code_id`, `jurisdiction_id`, `tax_category_id`, `rounding_code`) VALUES (79, '0', 'VAT', '150.0000', 20.69, 1, 'VAT', '16.000', NULL, NULL, NULL, 1)
---
    public function save_sales_tax(int $sale_id, array $sales_taxes): void    // TODO: should we return the result of the insert here as a bool?
    {
        $builder = $this->db->table('sales_taxes');

        foreach ($sales_taxes as $line => $sales_tax) {
            $sales_tax['sale_id'] = $sale_id;
            $builder->insert($sales_tax);

INSERT INTO `ospos_sales_items_taxes` (`sale_id`, `item_id`, `line`, `name`, `percent`, `tax_type`, `rounding_code`, `cascade_sequence`, `item_tax_amount`, `sales_tax_code_id`, `tax_category_id`, `jurisdiction_id`) VALUES (79, '1', 1, 'VAT', '16.000', '0', 1, 0, '20.6897', NULL, NULL, NULL)
---
    public function save_sales_items_taxes(int $sale_id, array $sales_item_taxes): void
    {
        $builder = $this->db->table('sales_items_taxes');

        foreach ($sales_item_taxes as $line => $tax_item) {
            $sales_items_taxes = [
                'sale_id'           => $sale_id,
                'item_id'           => $tax_item['item_id'],
                'line'              => $tax_item['line'],
                'name'              => $tax_item['name'],
                'percent'           => $tax_item['percent'],
                'tax_type'          => $tax_item['tax_type'],
                'rounding_code'     => $tax_item['rounding_code'],
                'cascade_sequence'  => $tax_item['cascade_sequence'],
                'item_tax_amount'   => $tax_item['item_tax_amount'],
                'sales_tax_code_id' => $tax_item['sales_tax_code_id'],
                'tax_category_id'   => $tax_item['tax_category_id'],
                'jurisdiction_id'   => $tax_item['jurisdiction_id']
            ];

            $builder->insert($sales_items_taxes);